{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of key frontend files in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, dark mode values, and global styling.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component rendering DeckViewer and global toast provider.",
  "frontend/src/components/deck/BulkImageUploadMapper.tsx": "Component for uploading multiple images and auto‑assigning them to predefined slide order.",
  "frontend/src/components/deck/DeckNavigator.tsx": "Sidebar navigator providing slide navigation buttons and thumbnails.",
  "frontend/src/components/deck/DeckViewer.tsx": "Main layout combining header, slide preview, navigation, image tools, export button, and footer.",
  "frontend/src/components/deck/ExportPptxButton.tsx": "Export button that triggers PPTX generation and shows status toasts.",
  "frontend/src/components/deck/icons.tsx": "Maps slide IDs to lucide-react icons and exports a lookup helper for retrieving the appropriate icon.",
  "frontend/src/components/deck/imageUrlUtils.ts": "Classifies image URLs, generates guidance and error messages, and provides placeholder text for export scenarios.",
  "frontend/src/components/deck/RemoteImage.tsx": "Image renderer with loading states, error handling, and special logic for non-direct URLs.",
  "frontend/src/components/deck/SlideCanvas.tsx": "Renders a full slide preview with themed layout, title, bullets, optional image, and slide number based on slide type.",
  "frontend/src/components/deck/SlideImageFields.tsx": "Provides UI to add, upload, edit, or remove images and captions for a slide, syncing changes with deck state.",
  "frontend/src/components/deck/ThumbnailItem.tsx": "Displays a compact clickable slide thumbnail with icon, title, and first bullet, highlighting the active slide.",
  "frontend/src/components/deck/useDeckState.ts": "Defines Zustand store for managing current slide and per-slide images, including defaults and bulk updates.",
  "frontend/src/content/slides.ts": "Exports static slide definitions containing IDs, titles, bullet points, and slide types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity with automatic query invalidation on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future backend query hooks; exports nothing.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, root color variables, dark mode theming, and base styling for the app.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pptx/exportDeckToPptx.ts": "Generates an HTML-based export of the slide deck, embedding images when possible and adding warnings for non-embeddable URLs.",
  "frontend/src/pptx/imageEmbedding.ts": "Empty module reserved for future PPTX image embedding logic.",
  "frontend/src/pptx/pptxgenjs.d.ts": "Empty TypeScript declaration placeholder for pptxgenjs integration.",
  "frontend/src/styles/deckTheme.ts": "Defines a minimal white-and-blue slide theme with fonts, colors, spacing, and sizing constants.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom color variables, typography, animations, and container settings.",
  "project_state.json": "Stores the project’s metadata, requirements, design rules, known issues, and feature descriptions for the slide deck system."
}