{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping product features to source files and components.",
  "frontend-file-summaries.txt": "Text file containing generated summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme colors.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Renders DeckViewer and toast notifications.",
  "frontend/src/components/deck/DeckNavigator.tsx": "Slide navigation UI with previous/next controls and thumbnail list.",
  "frontend/src/components/deck/DeckViewer.tsx": "Main layout combining header, slide preview, navigation, image fields, and footer.",
  "frontend/src/components/deck/ExportPptxButton.tsx": "Button that triggers HTML export of the presentation with loading and toast states.",
  "frontend/src/components/deck/icons.tsx": "Maps slide IDs to Lucide icons and provides a helper to retrieve the correct icon.",
  "frontend/src/components/deck/imageUrlUtils.ts": "Classifies image URLs, generates guidance/error messages, and supports export placeholder text based on URL validity.",
  "frontend/src/components/deck/RemoteImage.tsx": "Image component handling loading, validation guidance, and errors, preferring uploads when available.",
  "frontend/src/components/deck/SlideCanvas.tsx": "Renders slide content and images with academic theme, supporting uploaded screenshots for slide 11.",
  "frontend/src/components/deck/SlideImageFields.tsx": "UI component for managing slide images, handling URL input, uploads, classification, and syncing state with the deck store.",
  "frontend/src/components/deck/ThumbnailItem.tsx": "Renders a clickable slide thumbnail with icon, title, and preview text, highlighting the active slide.",
  "frontend/src/components/deck/useDeckState.ts": "Zustand store managing current slide index and slide image data, including defaults and update/remove actions.",
  "frontend/src/content/slides.ts": "Defines static slide content including IDs, titles, bullet points, and slide types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing auth state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing as backend has no methods.",
  "frontend/src/index.css": "Tailwind setup and theme variables for light/dark modes with global base styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pptx/exportDeckToPptx.ts": "Builds an HTML version of each slide with text and images and triggers a download as an .html file instead of a PPTX.",
  "frontend/src/pptx/pptxgenjs.d.ts": "Placeholder TypeScript declaration file for pptxgenjs with no content.",
  "frontend/src/styles/deckTheme.ts": "Exports a minimal white-and-blue academic slide theme defining colors, fonts, and spacing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata, requirements, design constraints, and known issues for building the Kisan Sahayak slide deck system."
}