{
  "kind": "build_request",
  "title": "Fix slide image preview visibility and deliver true PPTX download export",
  "projectName": "Kisan Sahayak Deck",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Fix the on-screen slide preview so assigned images actually render at a visible size whenever a slide has either (a) an uploaded image data URL or (b) a direct image URL, without collapsing to zero height or being hidden by the loading overlay.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "But I can't see the images there"
        ]
      },
      "acceptanceCriteria": [
        "When a slide has slideImages[slideId].uploadedDataUrl set, the slide preview shows the image reliably (no zero-height container, no perpetual overlay).",
        "When a slide has a direct image URL (e.g., ending in .jpg/.png), the slide preview shows the image reliably.",
        "If a slide uses a Google Images search URL (google.com/search?tbm=isch...), the preview shows the existing guidance placeholder instead of a broken/blank image area."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Replace the current HTML-based export in frontend/src/pptx/exportDeckToPptx.ts with generation of a real PowerPoint .pptx file download, embedding the slide text and any assigned images (prefer uploadedDataUrl over url) into the PPTX while preserving the existing minimal white + blue academic styling and 16:9 layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Should I re‑export the PPTX now so you get a working download file?",
          "Yeah go ahead"
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Export Presentation” downloads a file with a .pptx extension (not .html).",
        "The downloaded .pptx opens in PowerPoint/Google Slides as an editable presentation with 11 slides in 16:9.",
        "For slides with uploadedDataUrl images, the image is embedded into the PPTX and visible when opened.",
        "For slides with non-direct URLs (e.g., Google Images search URLs), the export flow provides a clear warning in English that those URLs cannot be embedded unless replaced with a direct image URL or an upload, and the export still completes (with that slide missing the image or using a placeholder text box)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the export UI messaging to reflect the real PPTX download flow (remove references to exporting HTML, printing to PDF, or screenshot instructions) and provide clear English success/error toasts that match the actual exported file type and any image-embed limitations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Say: \"Give me the download link now\" and I will send it immediately.",
          "The download link can only appear if the app successfully generated the PPTX file. Right now, your project hasn’t produced any real downloadable file, so there is no link available to send."
        ]
      },
      "acceptanceCriteria": [
        "On successful export, the toast message states that a .pptx file was downloaded/generated (no mention of HTML/PDF/screenshot workflows).",
        "On export failure, the toast provides an English error message and the app returns to a non-loading state.",
        "If some slides cannot embed remote images due to non-direct URLs, the user sees an English warning explaining how to fix it (use a direct image URL or upload) without breaking the export flow."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep backend as single-actor Motoko; only add backend changes if strictly required for PPTX export (prefer frontend-only export).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Adding a database or any external storage for images/files.",
    "Building a server-side/export-service flow; keep export in the client unless absolutely necessary."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}