{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix slide preview image visibility and implement true PPTX export download",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Ensure slide preview images render at a visible size for uploaded data URLs and direct image URLs, and never get stuck behind the loading overlay; keep Google Images search URL guidance placeholder.",
      "acceptanceCriteria": [
        "When a slide has slideImages[slideId].uploadedDataUrl set, the slide preview shows the image reliably (no zero-height container, no perpetual overlay).",
        "When a slide has a direct image URL (e.g., ending in .jpg/.png), the slide preview shows the image reliably.",
        "If a slide uses a Google Images search URL (google.com/search?tbm=isch...), the preview shows the existing guidance placeholder instead of a broken/blank image area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/deck/RemoteImage.tsx",
          "operation": "modify",
          "description": "Fix preview rendering by (1) resetting loading/error state when the effective image source changes, (2) ensuring the <img> uses sizing that does not depend on a parent with an explicit height (avoid h-full with an auto-height container), and (3) ensuring the loading overlay cannot permanently obscure the image once loaded."
        },
        {
          "path": "frontend/src/components/deck/SlideCanvas.tsx",
          "operation": "modify",
          "description": "Make the slide preview image area always allocate visible space (e.g., fixed height and/or aspect ratio) so the RemoteImage container cannot collapse to zero height; keep the layout consistent with the current white + blue academic styling."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Replace HTML-based export with client-side generation of a real editable .pptx file (16:9) embedding slide text and images (prefer uploadedDataUrl), preserving minimal white + blue styling and warning on non-direct image URLs without blocking export.",
      "acceptanceCriteria": [
        "Clicking “Export Presentation” downloads a file with a .pptx extension (not .html).",
        "The downloaded .pptx opens in PowerPoint/Google Slides as an editable presentation with 11 slides in 16:9.",
        "For slides with uploadedDataUrl images, the image is embedded into the PPTX and visible when opened.",
        "For slides with non-direct URLs (e.g., Google Images search URLs), the export flow provides a clear warning in English that those URLs cannot be embedded unless replaced with a direct image URL or an upload, and the export still completes (with that slide missing the image or using a placeholder text box)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pptx/exportDeckToPptx.ts",
          "operation": "modify",
          "description": "Implement true PPTX generation and download (not HTML) using a client-side PPTX generator; build 11 slides in 16:9, apply the existing minimal white + blue styling, add text content, and embed images by preferring uploadedDataUrl over remote URL. For non-direct image URLs, omit the image and insert a placeholder text box while collecting a user-facing warning message."
        },
        {
          "path": "frontend/src/pptx/pptxgenjs.d.ts",
          "operation": "modify",
          "description": "Add minimal TypeScript declarations needed for the PPTX generator used by exportDeckToPptx.ts so the build is type-safe (declare the PPTX API surface used for layout, slide creation, text, shapes, images, and file writing)."
        },
        {
          "path": "frontend/src/pptx/imageEmbedding.ts",
          "operation": "create",
          "description": "Add helper utilities for export to convert uploaded data URLs and fetchable direct image URLs into embed-ready image data (including graceful failure handling and a consistent way to detect/label non-embeddable URLs)."
        },
        {
          "path": "frontend/src/components/deck/imageUrlUtils.ts",
          "operation": "modify",
          "description": "Extend/align URL classification and export placeholder/warning text to ensure non-direct URLs (including Google Images search URLs) are consistently flagged as non-embeddable for PPTX export, with clear English guidance on how to fix (use a direct image URL or upload)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Update export UI messaging and toasts to reflect real PPTX download behavior, including success, failure, and non-blocking warnings for non-embeddable image URLs.",
      "acceptanceCriteria": [
        "On successful export, the toast message states that a .pptx file was downloaded/generated (no mention of HTML/PDF/screenshot workflows).",
        "On export failure, the toast provides an English error message and the app returns to a non-loading state.",
        "If some slides cannot embed remote images due to non-direct URLs, the user sees an English warning explaining how to fix it (use a direct image URL or upload) without breaking the export flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/deck/ExportPptxButton.tsx",
          "operation": "modify",
          "description": "Update export flow messaging: show a success toast explicitly for .pptx download, show a clear English error toast on failure while always returning to non-loading state, and display a non-blocking English warning toast if exportDeckToPptx reports slides with non-embeddable (non-direct) image URLs."
        },
        {
          "path": "frontend/src/pptx/exportDeckToPptx.ts",
          "operation": "modify",
          "description": "Adjust exportDeckToPptx to return structured results (e.g., warnings list and success indication) so the UI can accurately toast success/warning/error for the real PPTX generation flow."
        }
      ]
    }
  ]
}